 [
  {
  "summary": "Edmunds' comparison between the 2014 Acura MDX SH-AWD, 2014 Infiniti QX60 AWD and 2013 Lexus RX 350 F Sport. We find out which midsize crossover offers the best mix of sport, luxury and utility.",
  "link": "http://www.edmunds.com/lexus/rx-350/2013/comparison-test.html",
  "title": "2014 Acura MDX vs. 2014 Infiniti QX60 vs. 2013 Lexus RX 350 F Sport Comparison Test",
  "category": [
               "road tests",
               "fuel economy"
               ],
  "published": "2013-08-19",
  "content": "<p> After a spirited romp on a twisty section of Mulholland Highway in the 2014 Acura MDX, 2014 Infiniti QX60 and 2013 Lexus RX 350 F Sport, one of Edmunds' more opinionated editors hopped out of the Acura and pronounced: \"Yep, no doubt, the MDX wins this test.\" <br><br> If only it was that easy. <br><br> How these midsize luxury SUVs handle themselves is only one small aspect of this comparison. We still needed to assess long-haul seat comfort, headroom, cargo room, ease of access to the third row, standard active safety features, fuel mileage, stereo quality, etc. The boring stuff maybe, but also the important stuff. <br><br>   <br><br> That's because all-wheel-drive luxury crossovers have to do everything from carting the kids to baseball practice to picking up groceries, making Home Depot runs and taking the family on vacation.  <br><br> So we jumped back in and continued on. There was plenty of poking, prodding, measuring, phone pairing and, oh yes, plenty more driving to do. <br><br>  The Class Standard: 2013 Lexus RX 350 F Sport AWD   <br>Lexus is out to change the way you think about its mild-mannered  2013 Lexus RX 350  via the new F Sport model. The F Sport package consists of firmer shocks and springs, more aggressive bodywork, contrasting white stitching on the black leather, aluminum pedals and 19-inch dark graphite wheels. <br><br>   <br><br> At its base price of $47,895 (including $895 destination), the RX F Sport comes with all-wheel drive, Bluetooth, satellite radio, a USB port, 10-way power/heated/ventilated front seats, power sunroof and hatch, wood trim and lots of leather. <br><br> Options like a blind-spot monitor, a head-up display, 15-speaker Mark Levinson audio system, navigation and front and rear parking sensors upped our as-tested price to $53,924. One option not included in that price is a third-row seat, so the RX is the only vehicle here that's for five passengers only. <br><br> Its silky-smooth 3.5-liter V6 is rated at 270 horsepower, just like all RX 350s, and comes mated to an eight-speed automatic transmission with standard paddle shifters. Going for the F Sport package requires all-wheel drive, but its EPA fuel economy numbers are still reasonable at 21 mpg combined/18 city/26 highway. <br><br>  The Minivan of SUVs: 2014 Infiniti QX60 AWD  <br>Infiniti's QX60 (2013 models are known as the JX35 which is what we used for this test; other than the name change, there are no differences between the two) is an SUV for those people who wouldn't be caught dead driving a minivan. You know who they are. At 196.4 inches long riding on a 114.2-inch wheelbase, it's a land yacht among these three. <br><br> And the QX doesn't fake the three-row deal; it's the real thing, with enough space for adults along with a handy second-row seat-folding mechanism that makes third-row access a breeze. <br><br>   <br><br> Although the QX60 is powered by a 3.5-liter V6 just like its two rivals, it makes the least power (265 hp) while carrying the most weight (4,595 pounds). Unlike its two rivals, the power is put to all four wheels via a continuously variable transmission (CVT). EPA ratings are 21 mpg combined/19 city/25 highway. <br><br> The  2014 Infiniti QX60 AWD  starts at $43,945. Standard equipment includes heated power front seats, wood trim, power sunroof and tailgate, three-zone climate control, full keyless access, Bluetooth, USB port, satellite radio and a six-speaker audio system. <br><br> Our tester rang up at $57,435, but it was loaded to the gunwales with back-up collision prevention, blind-spot warning, lane-departure warning, radar cruise control and an around-view monitor with moving object detection, along with dual 7-inch color monitors behind the front headrests, Bose audio with 15 speakers, ventilated front seats, heated outboard second-row seats and navigation with an 8-inch display. <br><br>  The Driver's Choice: 2014 Acura MDX SH-AWD  <br>Since it came out in 2001, the  Acura MDX  has been exactly what you'd think the luxury arm of Honda would build: a family-friendly SUV with a frisky personality. <br><br>   <br><br> 2014 sees the arrival of an all-new MDX, though it's not readily apparent from the outside. But underneath is a new, lighter chassis unique to Acura's midsize crossover. The use of new high-strength materials along with other weight savings contributes to a 329-pound loss versus the last MDX we tested. <br><br> The previous 300-horse 3.7-liter V6 was swapped for a 290-hp, direct-injected 3.5-liter V6 with variable cylinder management. Paired with a six-speed automatic with paddle shifters, the MDX SH-AWD gets the best EPA highway rating of this group, with EPA ratings of 21 mpg combined/18 city/27 highway. <br><br> Also new is Acura's IDS (Integrated Dynamics System), which allows the electric-assist power steering to be switched among Comfort, Normal and Sport modes. Choosing Sport also increases throttle response and adjusts the torque proportioning of the all-wheel-drive system. <br><br> While the MDX SH-AWD starts at $45,185, our fully loaded Advance/Entertainment model, with navigation, premium Acura/ELS audio system with 12 speakers, ventilated front seats, power tailgate, blind-spot information, lane-keeping assist, radar cruise control and a 16.2-inch rear DVD screen boosted the as-tested price to $57,400. <br><br> Like the QX60, the MDX has a third row, though it's not as cavernous as the Infiniti's. In fact, the MDX falls right in between the RX and QX in most dimensions. <br><br>  <br>   <br>       <br>       Acura MDX   <br>    Infiniti QX60   <br>       Lexus RX 350   <br>   <br>   <br>      Price as Tested:  <br>      $57,400  <br>   $57,435  <br>      $53,924  <br>   <br>   <br>      Horsepower:  <br>      290  <br>   265  <br>      270  <br>   <br>   <br>      0-60 (sec.):  <br>      6.8  <br>   8.2  <br>      7.3  <br>   <br>   <br>      Quarter-mile:  <br>      15.0 @ 93.2  <br>   16.0 @ 89.2  <br>      15.4 @ 90.3  <br>   <br>   <br>      60-0 braking (ft.):  <br>      129  <br>   120  <br>      123  <br>   <br>   <br>      Slalom (mph):  <br>      60.7  <br>   60.0  <br>      62.4  <br>   <br>   <br>      Skid pad (g):  <br>      0.82  <br>   0.78  <br>      0.78  <br>   <br>   <br>      Edmunds fuel  economy (mpg):  <br>      18.0  <br>   16.4  <br>      20.5  <br>   <br> <br> <br><br>  3rd Place: 2013 Lexus RX 350 F Sport AWD  <br><br>   <br><br> The RX 350 F Sport is confused. The stiff suspension shouts, \"I'm a performance crossover.\" But its on-road handling isn't nearly sharp enough to make up for its sometimes choppy ride quality. The jumpy throttle doesn't do the RX any favors either, as it never feels natural, even with the most delicate right foot. <br><br> In fairness to the RX, it is capable of some admirable performance. Its 62.4-mph slalom speed was best-of-test, though that was largely because its stability control system was the least intrusive of the three vehicles. The steering has heavy weighting and good initial turn-in, but there's precious little feel as you try to aim it around curves. <br><br> The abundance of body roll is surprising given the stiff settings. We also noticed that the front tires give up grip quickly in tight turns. And what was the most lenient stability control system in the quick transitions of the slalom turned into the most aggressive in steady-state cornering. As such, the MDX with its high level of driver feedback meant the Acura could slice away from the RX pretty much at will any time the road turned curvy. <br><br> The RX's V6 was the smoothest of the group and the quietest at full throttle. The eight-speed automatic, though occasionally slow to react, delivers smooth, subtle shifts. The RX easily smoked the big Infiniti in acceleration tests, hitting 60 mph in 7.3 seconds (7.0  with a 1-foot rollout  as on a drag strip), but that still left it a half-second slower than the Acura. <br><br> It's definitely not all bad news here, though, as the RX proved fairly efficient, coming the closest of the group to matching its EPA rating of 21 mpg in combined driving with an average of 20.5 mpg overall. <br><br> The RX is also extremely comfortable in day-to-day driving. Its leather seats may lack lateral support, but in terms of comfort they're the best here. It also has the most luxuriously padded center and door armrests. And because the RX is a two-row crossover, it doesn't have to worry about the third-row compromise. So it's no surprise that the Lexus is easy to get in and out of, with the lowest front and rear step-in heights according to our measurements. <br><br> The RX's 80.3-cubic-feet max cargo capacity with the second-row seats folded shockingly beats the larger Infiniti, though it's still about 10 cubic feet shy of the Acura. <br><br> While the F Sport is decidedly un-Lexus in terms of ride quality, the cabin itself is classic Lexus. The materials are top-notch with plenty of thick, padded leather. Aside from the flimsy radio knobs, everything feels substantial and precisely put together. <br><br> The 8-inch display screen has terrifically sharp graphics, but Lexus' computer-mouselike Remote Touch Interface is more trouble than it's worth. We would prefer actual buttons or a well-designed touchscreen. Without question, the optional Mark Levinson 15-speaker audio system produced the heartiest, crispest sounds of all the vehicles in this test. <br><br>   <br><br> Unfortunately the 2013 Lexus RX 350 F Sport doesn't have enough extra sport in its driving dynamics, whether in terms of handling or straight-line acceleration, to make up for the sacrifices in ride quality. This F Sport is a neat theory in principle, but it wasn't executed in a way that made us like it more than the standard model. <br><br>  2nd Place: 2014 Infiniti QX60 AWD  <br><br>   <br><br> The 2014 Infiniti QX60 has neither the performance pedigree of the MDX nor a sport package like the RX 350. Rather, the QX60 is like an SUV version of Nissan's Quest minivan. <br><br> The largest and heaviest of this group, the QX doesn't take to twisty roads kindly. It was the sloppiest handler, both by instrumented numbers (60.0-mph slalom, 0.78g skid pad) and the ease with which the other two pulled away from it on the road. <br><br> Not that this was a huge shock to us, as the Infiniti carries 160 pounds over the Lexus RX and a whopping 270 pounds over the newly svelte Acura MDX. And you feel the Infiniti's heft as it flops from side to side on its soft suspension, this corner-wandering action compounded by overly light steering. <br><br> What the QX does exceptionally well is go straight. Bumps? What bumps? With the cushiest ride of the group, the QX laughs heartily at road imperfections. The QX's cabin is such a comfy, quiet and luxurious place to while away the miles, it prompted one editor to quip, \"Kansas, we've found your crossover.\" <br><br> Surprisingly, and despite plenty of nosedive, it stops the shortest of the group, too, with a reassuringly firm pedal. Sixty mph to zero took just 120 feet, versus 123 for the Lexus and a dismal 129 for the Acura. Of note, the QX is the only one of the three with ventilated rear brakes. They showed zero fade, which should bode well for long mountain descents. <br><br> The QX's interior falls just short of the Lexus' in terms of pure richness of materials, but ahead of the Acura, and the wood-trimmed two-tiered center stack is easily the classiest of the field. Plus, unlike the other two, the Infiniti allows all the major climate and audio functions to be accessed via the center stack, meaning you only have to go within the 8-inch center screen for little-used tasks or the navigation system. <br><br> With a handy second-row seatback/cushion tilt action, access to the third row requires hardly any crouching or squeezing. And there's enough room back there for average-size adults to sit comfortably. It's a better overall third-row setup than the Acura, so if you need seven-passenger flexibility on a regular basis, the QX is your best bet. <br><br> You'll pay for all that room, however, as the QX also turned in the poorest fuel mileage, averaging just 16.4 mpg during the course of the test compared to the MDX's 18 and the RX's 20.5. <br><br> Despite its large size, the QX ties the MDX for behind-third-row cargo capacity, at 15.8 cubic feet, and has the least max cargo room with all seats folded, at 76.4 cubic feet. But it also has the most load floor width between the wheelwells of the group, according to our measurements. <br><br>   <br><br> For many, the QX could be the best choice here. It has the most people room, the best access to the third row, the most comfortable ride, the most user-friendly controls and, according to most on staff, the best looks. <br><br> But we don't live in Kansas, so the QX finishes 2nd in this test. <br><br>  1st Place: 2014 Acura MDX SH-AWD  <br>The 2014 Acura MDX won this test not because of its superior handling. Instead, its win can be chalked up to finishing at or near the top in nearly every other category as well. <br><br>   <br><br> If you care the least bit about the act of driving, the MDX is the one that will warm your soul. Its V6 is the most eager of the three, and it provides true aural pleasure. Not only did it storm to 60 mph faster than the Lexus and Infiniti, it was 0.5 second quicker than the last MDX we tested. <br><br> The six-speed automatic shifts crisply and quickly under full throttle, yet gives nearly imperceptible upshifts any other time. Unlike the Lexus, it will hold gears to the 7,000-rpm limiter when using the steering-wheel paddles and it delivers crisp throttle-blip downshifts. <br><br> There's a noticeable VTEC switchover snarl at 5,000 rpm, but unless you're at full throttle in Drive mode the transmission does everything it can to make sure it shifts before you get to hear it. Blame previous MDX owners who complained of the noise. <br><br> It's also the reason why there's plenty of sound-deadening material throughout the cabin as well, including three-layer acoustic glass for the front side windows. It worked. The MDX was the quietest when cruising at 70 mph. <br><br> On paper, it appears the MDX's handling was aided by the widest tires of the bunch, its Michelin Latitude Tour HP all-seasons measuring 245/55R19 front and rear. Even with a healthy amount of understeer, the MDX posted a test-best skid pad of 0.82g versus 0.78g for the RX and QX. <br><br> Helping the Acura dominate in the twisty bits was its three-way adjustable steering. Our staff proved why this is a handy feature, as some preferred Normal, even through canyons, while others set it to the quicker-reacting Sport all the time. <br><br> But its lackluster 60-0 braking number of 129 feet showed the MDX's handling goodness was more due to its fine suspension tuning than tire grip. And the weak brakes meant distances got longer with each stop. Pedal feel, whether on road or track, was spongy and uninspiring. <br><br> Inside the MDX there's a completely redesigned cabin. While the materials are adequate, they aren't up to Lexus levels and the design isn't pretty like the Infiniti's. One editor said of the V-shaped, black-plastic-dominated center stack: \"It's just plain dull.\" <br><br> Which would be fine if it worked well. Acura's button cleansing from the center stack forces nearly every function to be done via the lower 7-inch touchscreen or the odd tilting/scroll wheel controller for the 8-inch upper display. The result is that even changing simple things like fan speed or adjusting the seat cooler level now takes no fewer than two actions. Even with the touchscreen's haptic feedback, it's a silly system. <br><br> Climate/infotainment aggravations aside, the rest of the MDX's cabin is excellent. The front seats, while not as cushy as the RX's, are superb in their combination of all-day comfort and body-hugging lateral support. The second row is quite high, though, with plenty of headroom, a two-fold effect that aids second-row leg comfort along with third-row foot room. <br><br>   <br><br> Third-row access is a snappy one-button-push affair to slide the second-row seats forward, but it's still a bit of a squeeze for adults. Getting back out is more of a chore because the third row sits so low. The MDX benefits from a fully flat load floor, the lowest cargo loading height (according to our measurements) and the most max cargo room at 90.9 cubic feet. <br><br> The MDX managed just 18 mpg during its time with us. But in a comparison with the Lexus and Infiniti on the 116-mile Edmunds test loop, the MDX returned 22.4 mpg, versus the RX's 21.3 and the QX's 18.9. <br><br>  What's Good for the Goose...  <br>Whether you're into driving fast or slow, straight or curvy, hauling a truckload of kids or maybe it's just two people going out to dinner, the 2014 Acura MDX SH-AWD does it all well. <br><br> The same can't be said about the 2013 Lexus RX 350 F Sport. It's sitting on a fence, trying to figure out if it should lean toward sporty or cushy, and it ends up doing neither well. Yes, it's finely crafted, but there's not enough \"sport\" in it to feel great. The firm ride will be a deal-breaker for some, as will the lack of a third-row option. <br><br> The 2014 Infiniti QX60 AWD is slow and inefficient compared to the Acura and the Lexus. But damn if it isn't the ultimate people-hauler. Probably why it's completely uninspiring to drive. <br><br> The 2014 Acura MDX just had too many \"bests\" to be denied: the best handling, the best front seats, the quickest acceleration, the largest max cargo capacity and the potential for the best fuel economy. And without question, it's the driver's SUV of the trio. <br><br> But more than that, the Acura MDX was the one we'd most like to spend time in. It makes daily chores feel much less like, well, chores. <br><br>  The manufacturers provided Edmunds with these vehicles for the purposes of evaluation. Due to the lack of availability of a 2014 Infiniti QX60 in time for this test, a mechanically identical 2013 Infiniti JX35 was utilized.  </p>",
  "vehicles": [
               {
               "make": {
               "id": 200001623,
               "name": "Lexus",
               "niceName": "lexus"
               },
               "model": {
               "id": "Lexus_RX_350",
               "name": "RX 350",
               "niceName": "rx-350"
               },
               "year": {
               "id": 200419750,
               "year": 2013
               }
               }
               ]
  },
  {
  "link": "http://www.edmunds.com/lexus/rx-350/2013/index.html",
  "title": "2013 Lexus RX 350 Review",
  "category": [],
  "published": "2012-06-05",
  "content": "<p><p>The 2013 Lexus RX 350 seats five people and is available in  a single trim level. The hybrid RX 450h is covered in a separate review.</p><br><p>Standard equipment includes 18-inch alloy wheels, automatic  headlamps, foglamps, LED running lamps, rear privacy glass, heated mirrors, a power  liftgate, keyless ignition/entry, dual-zone automatic climate control,  eight-way power front seats with two-way adjustable lumbar, a leather-wrapped  power tilt-and-telescoping steering wheel, a sliding and reclining rear seat,  cloth upholstery, an auto-dimming rearview mirror, Safety Connect emergency communications,  Bluetooth phone and audio connectivity, and a nine-speaker sound system with a  six-CD changer, satellite radio and an iPod/USB audio interface.</p><br><p>The Display Audio With Back-up Monitor package adds a  rearview camera, a larger central display screen, Bluetooth phonebook download  capabilities, the Lexus Remote Touch electronics interface, the Enform suite of  app-based features, real-time traffic and other information, and a 12-speaker  sound system with HD radio and iTunes song tagging.</p><br><p>The Premium package adds a sunroof, power-folding mirrors,  roof rails, a rearview camera, leather upholstery and driver memory functions.</p><br><p>If that's not enough stuff, the Comfort or Navigation  packages can be added to the Premium package. Comfort adds automatic wipers,  xenon headlamps and heated and ventilated front seats (available separately).  Navigation adds the Display Audio with Back-up Monitor contents plus a  navigation system and voice controls. </p><br><p>The Luxury package requires the Premium, Comfort and  Navigation packages. To them it adds 19-inch wheels, LED headlamps (available  separately), 10-way power front seats, a heated wood/leather steering wheel,  upgraded leather upholstery and a smog-sensing auto climate control  recirculation.</p><br><p>The F Sport package adds to all-wheel-drive models 19-inch  wheels, an eight-speed automatic transmission, a sport-tuned suspension,  special exterior styling elements, special white-accented interior trim and  perforated leather upholstery. The wheels and special styling can be added to  front-drive models with the Sport package.</p><br><p>The Navigation and Luxury packages can be enhanced with a  head-up display, a dual-screen rear entertainment system and a 15-speaker Mark  Levinson surround-sound audio system. Other stand-alone options include an  automatic parallel parking system and adaptive cruise control with a  pre-collision warning system (requires all-wheel drive).</p></p>",
  "vehicles": [
               {
               "make": {
               "id": 200001623,
               "name": "Lexus",
               "niceName": "lexus"
               },
               "model": {
               "id": "Lexus_RX_350",
               "name": "RX 350",
               "niceName": "rx-350"
               },
               "year": {
               "id": 200419750,
               "year": 2013
               }
               }
               ]
  }
  ]
